import random

choice = ''
print("[m] - Male name | [f] - Female name | [e] - exit")

male_names = ["Александр", "Алексей", "Альберт", "Анатолий", "Андрей", "Антон", "Аркадий", "Арсений", "Артём", "Артур",
              "Борис", "Вадим", "Виктор", "Виталий", "Владимир", "Владислав", "Вячеслав", "Геннадий", "Георгий", "Глеб",
              "Григорий", "Даниил", "Денис", "Дмитрий", "Евгений", "Егор", "Иван", "Игорь", "Илья", "Кирилл",
              "Константин", "Максим", "Матвей", "Михаил", "Никита", "Николай", "Олег", "Павел", "Роман", "Руслан",
              "Семён", "Сергей", "Степан", "Эдуард", "Юрий", "Ян"]  # 46

female_names = ["Алёна", "Александра", "Алина", "Алиса", "Анастасия", "Анна", "Валерия", "Варвара", "Вера", "Вероника",
                "Виктория", "Влада", "Диана", "Дарья", "Евгения", "Екатерина", "Елена", "Елизавета", "Есения", "Жанна",
                "Инга", "Ирина", "Кристина", "Ксения", "Людмила", "Маргарита", "Мария", "Марина", "Надежда", "Наталья",
                "Оксана", "Ольга", "Полина", "Софья", "Татьяна", "Юлия", "Яна"]  # 37

surnames = ["Смирнов", "Иванов", "Кузнецов", "Попов", "Соколов", "Лебедев", "Козлов", "Новиков", "Морозов", "Петров",
            "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов", "Семёнов", "Виноградов", "Богданов", "Воробьёв",
            "Фёдоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров", "Орлов", "Киселёв", "Макаров", "Андреев",
            "Ковалёв", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев", "Баранов", "Куликов", "Алексеев", "Степанов",
            "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров", "Борисов", "Королёв", "Герасимов", "Пономарёв",
            "Григорьев", "Лазарев", "Медведев", "Ершов", "Никитин", "Соболев", "Рябов", "Поляков", "Цветков", "Данилов",
            "Жуков", "Фролов", "Журавлев", "Николаев", "Крылов", "Максимов", "Сидоров", "Осипов", "Белоусов", "Федотов",
            "Дорофеев", "Егоров", "Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов", "Петухов", "Антонов",
            "Тимофеев", "Никифоров", "Филиппов", "Марков", "Суханов", "Ширяев", "Александров", "Коновалов", "Шестаков",
            "Казаков", "Ефимов", "Денисов", "Громов", "Давыдов", "Мельников", "Щербаков", "Блинов", "Карпов"]  # 95

while True:
    choice = input('m/f/e: ')
    if choice == 'm':
        print(random.choice(male_names), random.choice(surnames))
    elif choice == 'f':
        print(random.choice(female_names), random.choice(surnames) + 'а')
    else:
        break
